package tests;

public interface Autoutil {

	String[] FolderName = { "AutoTest", "#@$",
			"abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZIJKLMNOPQRSTUVWXYabcdefghijklmnA" };
	
	
	String[] File84 = {
		"abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZIJKLMNOPQRSTUVWXYVWXYZIJKLMN.png",
		"ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺＰＱＲＳＴＵＶＷＸＹＺＴＵＶＷＸＹＴＵＶＷＸＹＺＰＱＲＳ.png",
		"111111111111111111111111111111111111111111111111111111111111111111111111111111111111",
		"１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１",
		"ｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜﾗﾊﾏﾔﾗﾜﾗﾜｱｶﾊﾏﾔﾗﾜﾗｻﾀﾅﾊﾊ.png",
		"アカサタナハマヤラワアカサタナハマヤラワアカサタナハマヤラワアカサタナハマヤラワアカサタナハマヤラワアカサタナハマヤヤラワアカサタナハマヤラワアカサタナハマヤヤ.png",
		"あぁかさたないぃきしちにあぁかさたないぃきしちにあぁかさたないぃきしちにあぁかぁかさたないぃきしちにあぁかさたないぃきしちにあさたないぃきしちにあぁかさたないぃ.png",
		"教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教教育漢字教育漢字教育漢.png",
		"－｀～［｛］～｝＇；．，！＠＃＄％＾＆（）－｀～［｛］～｝＇；．，！＠＃＄％＿＋＝－｀～［｛］｝＇；．，！＠＃＄％＾＆（）＿＋＝－｀～［｛］｝＇；．，！＠＃＄＋.png"
		};
	String[] FileRename84 = {
			"abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZIJKLMNOPQRSTUVWXYVWXYZIJKLMN",
			"ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺＰＱＲＳＴＵＶＷＸＹＺＴＵＶＷＸＹＴＵＶＷＸＹＺＰＱＲＳ",
			"11111111111111111111111111111111111111111111111111111111111111111111111111111111",
			"１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１",
			"ｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜﾗﾊﾏﾔﾗﾜﾗﾜｱｶﾊﾏﾔﾗﾜﾗｻﾀﾅﾊﾊ",
			"アカサタナハマヤラワアカサタナハマヤラワアカサタナハマヤラワアカサタナハマヤラワアカサタナハマヤラワアカサタナハマヤヤラワアカサタナハマヤラワアカサタナハマヤヤ",
			"あぁかさたないぃきしちにあぁかさたないぃきしちにあぁかさたないぃきしちにあぁかぁかさたないぃきしちにあぁかさたないぃきしちにあさたないぃきしちにあぁかさたないぃ",
			"教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教教育漢字教育漢字教育漢",
			"－｀～［｛］～｝＇；．，！＠＃＄％＾＆（）－｀～［｛］～｝＇；．，！＠＃＄％＿＋＝－｀～［｛］｝＇；．，！＠＃＄％＾＆（）＿＋＝－｀～［｛］｝＇；．，！＠＃＄＋"
			};


		String [] File85 = {
		"aabcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZIJKLMNOPQRSTUVWXYVWXYZIJKLMN.png",
		"ａａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺＰＱＲＳＴＵＶＷＸＹＺＴＵＶＷＸＹＴＵＶＷＸＹＺＰＱＲＳ.png",
		"1111111111111111111111111111111111111111111111111111111111111111111111111111111111111",
		"１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１１",
		"ｶｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜﾗﾊﾏﾔﾗﾜﾗﾜｱｶﾊﾏﾔﾗﾜﾗｻﾀﾅﾊﾊ.png",
		"アアカサタナハマヤラワアカサタナハマヤラワアカサタナハマヤラワアカサタナハマヤラワアカサタナハマヤラワアカサタナハマヤヤラワアカサタナハマヤラワアカサタナハマヤヤ.png",
		"ああぁかさたないぃきしちにあぁかさたないぃきしちにあぁかさたないぃきしちにあぁかぁかさたないぃきしちにあぁかさたないぃきしちにあさたないぃきしちにあぁかさたないぃ.png",
		"教教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教教育漢字教育漢字教育漢.png",
		"－－｀～［｛］～｝＇；．，！＠＃＄％＾＆（）－｀～［｛］～｝＇；．，！＠＃＄％＿＋＝－｀～［｛］｝＇；．，！＠＃＄％＾＆（）＿＋＝－｀～［｛］｝＇；．，！＠＃＄＋.png"
		};
		
		String FileUnsupport[] = {
				"/",
				"\\",
				".snapshot",
				".SNAPSHOT",
				".snapshots",
				".SNAPSHOTS",
				".Snapshot",
				"CON",
				"PRN",
				"AUX",
				"NUL",
				"CLOCK$",
				"COM0",
				"COM1",
				"COM2",
				"COM3",
				"COM4",
				"COM5",
				"COM6",
				"COM7",
				"COM8",
				"COM9",
				"LPT0",
				"LPT1",
				"LPT2",
				"LPT3",
				"LPT4",
				"LPT5",
				"LPT6",
				"LPT7",
				"LPT8",
				"LPT9",
				"con",
				"prn",
				"aux",
				"nul",
				"clock$",
				"com0",
				"com1",
				"com2",
				"com3",
				"com4",
				"com5",
				"com6",
				"com7",
				"com8",
				"com9",
				"lpt0",
				"lpt1",
				"lpt2",
				"lpt3",
				"lpt4",
				"lpt5",
				"lpt6",
				"lpt7",
				"lpt8",
				"lpt9",
				"test.",
				"test ",
				" test"
				
				
		};
		
		
		

}
