package tests;

public interface FileUpload {
	String[] PNG_Files = { "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZIJKLMNOPQRSTUVWXY.png",
			"ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺＰＱＲＳＴＵＶＷＸＹＺＴＵＶＷＸＹ.png",
			"－｀～［｛］～｝＇；．，！＠＃＄％＾＆（）＿＋＝－｀～［｛］｝＇；．，！＠＃＄％＾＆（）＿＋＝－｀～［｛］｝＇；．，！＠＃＄％＾＆（）＿＋.png",
			"ｱｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜｱｶｻﾀﾅﾊﾏﾔﾗﾜﾗﾜｱｶｻﾀﾅﾊﾊ.png",
			"アカサタナハマヤラワアカサタナハマヤラワアカサタナハマヤラワアカサタナハマヤラワアカサタナハマヤラワアカサタナハマヤラワアカサタナハマヤヤ.png",
			"あぁかさたないぃきしちにあぁかさたないぃきしちにあぁかさたないぃきしちにあぁかさたないぃきしちにあぁかさたないぃきしちにあぁかさたないぃき.png",
			"教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教育漢字教.png",
			"𠀋𩸽𠀋𩸽𠀋𩸽𠀋𩸽𠀋𩸽𠀋𩸽𠀋𩸽𠀋𩸽𠀋𩸽𠀋𩸽𠀋𩸽𠀋𩸽𠀋𩸽𠀋𩸽𠀋𩸽𠀋𩸽𠀋𩸽.png" };

}
